Validation/boil/deltaT10/0/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 21.9E6;

boundaryField
{
    up
    {
      //type            fixedValue;
      //value           uniform 21.9E6;
        type            totalPressure;
        p0              uniform 21.9E6;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 21.9E6;
    }
    "wall.*"
    {
        type            symmetryPlane;
    }
    down
    {
        type            fixedFluxPressure;
        gradient        uniform 21.9E6;
        value           uniform 21.9E6;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
