Validation/boil/deltaT10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    up
    {
        type            patch;
        nFaces          64;
        startFace       24320;
    }
    wallLeft
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          192;
        startFace       24384;
    }
    wallRight
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          192;
        startFace       24576;
    }
    down
    {
        type            patch;
        nFaces          64;
        startFace       24768;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24576;
        startFace       24832;
    }
)

// ************************************************************************* //
