Validation/boil/deltaT10/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Numerical simulation of bubble growth in film boiling using a coupled
//level-set and volume-of-fluid method
//Autors: G. Tomar and etc

// for critical water at near critical pressure Pr=0.99



phaseChangeTwoPhaseMixture Lee;

pSat    pSat      [1 -1 -2 0 0 0 0]   21.9E6;
       			 	
TSat		TSat	    [0 0 0 1 0]	        500;
R       R         [0 2 -2 -1 0 0 0]   461.0; //add
TSatLocal       false;

Hfg		Hfg	[0 2 -2 0 0] 10e03;

sigma           sigma [1 0 -2 0 0 0 0] 0.1;

phase1
{
    transportModel Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 2.5e-4; 
    rho             rho [1 -3 0 0 0 0 0] 200;
    C		    C   [0 2 -2 -1 0 0 0] 400;
    K		    K  [1 1 -3 -1 0 0 0]   40;
}

phase2
{
    transportModel Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1e-4;
    rho             rho [1 -3 0 0 0 0 0] 5;
    C		    C [0 2 -2 -1 0 0 0] 200;
    K		    K  [1 1 -3 -1 0 0 0]   1;
}

HardtCoeffs
{
   Cv            Cv   [0 0 0 0 0 0 0]    1; 
   rv            rv   [0 0 0 0 0 0 0]    1;
   rc            rc   [0 0 0 0 0 0 0]    0; 
}

LeeCoeffs
{
  rv            rv   [0 0 -1 0 0 0 0]    100000;//100; //add
  rc            rc   [0 0 -1 0 0 0 0]    10;  
}
FourierCoeffs {}
// ************************************************************************* //
